app/controllers/class3create_controller.rb

  def createpost
  	f1 = params[:msg]
  	f2 = params[:user_id]
  	@msg = f1
  	@user_id = f2
  	Post.create(msg: @msg,user_id: @user_id)
---
INSERT INTO "posts" ("msg", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["msg", "yohellohahaha"], ["user_id", 1], ["created_at", "2021-09-08 00:09:54.806732"], ["updated_at", "2021-09-08 00:09:54.806732"]]